Repository: darviarush/perl-aion-sige
Catalog: i18n/Aion/Sige.*.po
Languages: ru_en

source: Aion::Sige - шаблонизатор html, для подключения к vue.js
ru_en: Aion::Sige - html template engine for connecting to vue.js

source: Файл lib/Product.pm:
ru_en: lib/Product.pm file:

source: Файл lib/Product/List.pm:
ru_en: File lib/Product/List.pm:

source: Aion::Sige анализирует html в разделе \__DATA__ или в одноименном html-файле, расположенном рядом с модулем.
ru_en: Aion::Sige parses html in the \__DATA__ section or in the html file of the same name located next to the module.

source: Вычисляются значения атрибутов, заключенные в одинарные кавычки. Значения атрибутов без кавычек также рассчитываются. В них не должно быть пробелов.
ru_en: Attribute values enclosed in single quotes are calculated. Attribute values without quotes are also calculated. There should be no spaces in them.

source: Теги с дефисом в названии считаются классами и соответствующим образом преобразуются: `<Product::List list=list>` в `use Product::List; Product::List->new(list => $self->list)->render`.
ru_en: Tags with a hyphen in their name are considered classes and are converted accordingly: `<Product::List list=list>` to `use Product::List; Product::List->new(list => $self->list)->render`.

source: Срабатывает, когда роль прикреплена к классу. Компилирует код sige в код Perl, чтобы `@routine` стал методом класса.
ru_en: Fires when a role is attached to a class. Compiles sige code into Perl code so that `@routine` becomes a class method.

source: Компилирует шаблон (`$template`) в Perl-код и подключает его подпрограммы к пакету (`$pkg`).
ru_en: Compiles a template (`$template`) into Perl code and connects its routines to a package (`$pkg`).

source: Компилирует sige в указанном пакете.
ru_en: Compiles sige in the specified package.

source: Если у вас достаточно прав, он создает файл рядом с файлом $pkg-module и расширением `.pm$sige`, затем подключает этот файл с помощью `require` и удаляет его. Это сделано для обеспечения адекватной трассировки стека.
ru_en: If you have enough permissions, it creates a file next to the $pkg-module file with a `.pm$sige` extension, then includes that file with `require` and deletes it. This is done to ensure an adequate stack trace.

source: Если прав недостаточно, то просто выполнится `eval`.
ru_en: If there are not enough rights, then `eval` will simply be executed.

source: Файл lib/RequireSige.pm:
ru_en: File lib/RequireSige.pm:

source: Код шаблона находится в одноименном файле `*.html` рядом с модулем или в разделе `__DATA__`. Но не одновременно.
ru_en: The template code is located in the `*.html` file of the same name next to the module or in the `__DATA__` section. But not at the same time.

source: Файл lib/Ex.pm:
ru_en: lib/Ex.pm file:

source: Файл lib/Ex.html:
ru_en: File lib/Ex.html:

source: С начала строки и символа @ начинаются методы, которые можно вызвать из пакета:
ru_en: The beginning of the line and the @ symbol begin the methods that can be called from the package:

source: Файл lib/ExHtml.pm:
ru_en: lib/ExHtml.pm file:

source: Файл lib/ExHtml.html:
ru_en: File lib/ExHtml.html:

source: Выражение в `{{ }}` вычисляется.
ru_en: The expression in `{{ }}` is evaluated.

source: Файл lib/Ex/Insertions.pm:
ru_en: File lib/Ex/Insertions.pm:

source: ## Evaluate attrs
ru_en: ## Evaluate attributes

source: Атрибуты со значениями в `""` считаются строкой, а атрибуты в `''` или без кавычек считаются выражением.
ru_en: Attributes with values in `""` are considered a string, and attributes in `''` or without quotes are considered an expression.

source: Если значение атрибута — `undef`, то атрибут не рендерится.
ru_en: If the attribute value is `undef`, then the attribute is not rendered.

source: Файл lib/Ex/Attrs.pm:
ru_en: File lib/Ex/Attrs.pm:

source: Файл lib/Ex/If.pm:
ru_en: File lib/Ex/If.pm:

source: 1. Теги area, base, br, col, embed, hr, img, input, link, мета, param, source, track и wbr отображаются без закрывающего тега или косой черты. 2. К тегам HTML добавляется закрывающий тег. 3. Свойство `content => ...` не передается в теги perl-модуля.
ru_en: 1. The area, base, br, col, embed, hr, img, input, link, meta, param, source, track and wbr tags are displayed without a closing tag or slash. 2. A closing tag is added to the HTML tags. 3. The `content => ...` property is not passed to the perl module tags.

source: Теги с `::` используют другие модули Perl.
ru_en: Tags with `::` are used by other Perl modules.

source: Файл lib/Hello.pm:
ru_en: lib/Hello.pm file:

source: Файл lib/Hello/World.pm:
ru_en: File lib/Hello/World.pm:

source: HTML-комментарии (`<!-- ... -->`) удаляются из текста.
ru_en: HTML comments (`<!-- ... -->`) are removed from the text.
